tutorials/fluidSolidInteraction/wavesOnDam/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel    linearGeometryTotalDisplacement;
solidModel    coupledUnsLinearGeometryLinearElastic;
//solidModel    unsLinearGeometry;
//solidModel    nonLinearGeometryTotalLagrangian;
//solidModel    nonLinearGeometryUpdatedLagrangian;
//solidModel    unsNonLinearGeometryTotalLagrangian;

coupledUnsLinearGeometryLinearElasticCoeffs
{}

"linearGeometryTotalDisplacementCoeffs|unsLinearGeometryCoeffs"
{}

nonLinearGeometryTotalLagrangianCoeffs
{}

nonLinearGeometryUpdatedLagrangianCoeffs
{}

unsNonLinearGeometryTotalLagrangianCoeffs
{}

unsNonLinearGeometryUpdatedLagrangianCoeffs
{}

// ************************************************************************* //
